;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  UNITS / TROOPERS
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[DarkMecTrooper_M1 X2CharacterTemplate]
strCharacterName="增强的MEC士兵"
strCharacterBackgroundMale[0]="<XGParam:StrValue1/!FirstName/> 在一次行动中被XCOM捕获。经过一些审讯和“说服”，他们现在愿意为XCOM工作。"  
strCharacterBackgroundFemale[0]="<XGParam:StrValue1/!FirstName/> 在一次行动中被XCOM捕获。经过一些审讯和“说服”，他们现在愿意为XCOM工作。"  

[DarkMecTrooper_M2 X2CharacterTemplate]
strCharacterName="升级的MEC士兵"
strCharacterBackgroundMale[0]="<XGParam:StrValue1/!FirstName/> 在一次行动中被XCOM捕获。经过一些审讯和“说服”，他们现在愿意为XCOM工作。"  
strCharacterBackgroundFemale[0]="<XGParam:StrValue1/!FirstName/> 在一次行动中被XCOM捕获。经过一些审讯和“说服”，他们现在愿意为XCOM工作。"  

[DarkMecTrooper_M3 X2CharacterTemplate]
strCharacterName="尊贵的MEC士兵"
strCharacterBackgroundMale[0]="<XGParam:StrValue1/!FirstName/> 在一次行动中被XCOM捕获。经过一些审讯和“说服”，他们现在愿意为XCOM工作。"  
strCharacterBackgroundFemale[0]="<XGParam:StrValue1/!FirstName/> 在一次行动中被XCOM捕获。经过一些审讯和“说服”，他们现在愿意为XCOM工作。"  

;[DarkMecTrooper_MABC X2CharacterTemplate]
;strCharacterName="复活的机甲士兵"
;strCharacterBackgroundMale[0]="<XGParam:StrValue1/!FirstName/> 在一次行动中被XCOM捕获。经过一些审讯和“说服”，他们现在愿意为XCOM工作。"  
;strCharacterBackgroundFemale[0]="<XGParam:StrValue1/!FirstName/> 在一次行动中被XCOM捕获。经过一些审讯和“说服”，他们现在愿意为XCOM工作。"  

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  WEAPONS
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[DarkSparkRifle_CV X2WeaponTemplate]
FriendlyName="暗黑机甲自动炮"
FriendlyNamePlural="暗黑机甲自动炮"
BriefSummary="暗黑机甲自动炮以极端速度发射中口径弹丸，造成巨大的内部伤害。"
TacticalText="<Bullet/> 在没有特殊训练的情况下，使用主武器射击将结束士兵的回合。"
AbilityDescName="暗黑机甲自动炮"

[DarkSparkRifle_MG X2WeaponTemplate]
FriendlyName="暗黑机甲轨道炮"
FriendlyNamePlural="暗黑机甲轨道炮"
BriefSummary="暗黑机甲轨道炮以极端速度发射高口径弹丸，造成巨大的内部伤害。"
TacticalText="<Bullet/> 在没有特殊训练的情况下，使用主武器射击将结束士兵的回合。"
AbilityDescName="暗黑机甲轨道炮"

[DarkSparkRifle_BM X2WeaponTemplate]
FriendlyName="暗黑机甲粒子投影炮"
FriendlyNamePlural="暗黑机甲粒子投影炮"
BriefSummary="暗黑机甲粒子投影炮使用多个加速轮廓来创建一束超电荷粒子的聚焦光束，在任何射程下都保持有效。" 
TacticalText="<Bullet/> 在没有特殊训练的情况下，使用主武器射击将结束士兵的回合。"
AbilityDescName="暗黑机甲粒子投影炮"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  PERKS
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[DarkAbsorptionFields X2AbilityTemplate]
LocFriendlyName="吸收力场"
LocFlyOverText="吸收力场"
LocLongDescription="受到的伤害减少 <Ability:MOCXMECDARKABSORB/>%"
LocHelpText="受到的伤害减少 <Ability:MOCXMECDARKABSORB/>%"

[MOCXMECSTRIKE X2AbilityTemplate]
LocFriendlyName="拳击打击"
LocFlyOverText="拳击打击"
LocLongDescription="单位发出的重拳攻击。有 <Ability:MOCXMECStrikeCoolDown/> 回合的冷却时间。拳击攻击具有固有的 +<Ability:MOCXMECStrikeAimBonus/> 命中加成。"
LocHelpText="单位发出的重拳攻击。有 <Ability:MOCXMECStrikeCoolDown/> 回合的冷却时间。拳击攻击具有固有的 +<Ability:MOCXMECStrikeAimBonus/> 命中加成。"

[TriangulationMECDP X2AbilityTemplate]
LocFriendlyName="三角定位"
LocLongDescription="当MEC士兵受到攻击时，其小队在下个回合对该目标获得 +10 命中。"
LocHelpText="当MEC士兵受到攻击时，其小队在下个回合对该目标获得 +10 命中。"
LocFlyOverText="三角定位"
LocPromotionPopupText="<Bullet/> MEC士兵能够追踪来袭弹药回溯到其原始发射者，并将该信息上传给整个团队。<br/><Bullet/> 如果敌人攻击MEC士兵的小队成员，三角定位不会触发。<br/>"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;  COSMETICS
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[DarkMec_Torso_F1 X2BodyPartTemplate]
DisplayName="暗黑机甲躯干 F1"

[DarkMec_Arms_F1 X2BodyPartTemplate]
DisplayName="暗黑机甲手臂 F1"

[DarkMec_Legs_F1 X2BodyPartTemplate]
DisplayName="暗黑机甲腿部 F1"

[DarkMec_Torso_F2 X2BodyPartTemplate]
DisplayName="暗黑机甲躯干 F2"

[DarkMec_Arms_F2 X2BodyPartTemplate]
DisplayName="暗黑机甲手臂 F2"

[DarkMec_Legs_F2 X2BodyPartTemplate]
DisplayName="暗黑机甲腿部 F2"

[DarkMec_Torso_F3 X2BodyPartTemplate]
DisplayName="暗黑机甲躯干 F3"

[DarkMec_Arms_F3 X2BodyPartTemplate]
DisplayName="暗黑机甲手臂 F3"

[DarkMec_Legs_F3 X2BodyPartTemplate]
DisplayName="暗黑机甲腿部 F3"

[DarkMec_Torso_M1 X2BodyPartTemplate]
DisplayName="暗黑机甲躯干 M1"

[DarkMec_Arms_M1 X2BodyPartTemplate]
DisplayName="暗黑机甲手臂 M1"

[DarkMec_Legs_M1 X2BodyPartTemplate]
DisplayName="暗黑机甲腿部 M1"

[DarkMec_Torso_M2 X2BodyPartTemplate]
DisplayName="暗黑机甲躯干 M2"

[DarkMec_Arms_M2 X2BodyPartTemplate]
DisplayName="暗黑机甲手臂 M2"

[DarkMec_Legs_M2 X2BodyPartTemplate]
DisplayName="暗黑机甲腿部 M2"

[DarkMec_Torso_M3 X2BodyPartTemplate]
DisplayName="暗黑机甲躯干 M3"

[DarkMec_Arms_M3 X2BodyPartTemplate]
DisplayName="暗黑机甲手臂 M3"

[DarkMec_Legs_M3 X2BodyPartTemplate]
DisplayName="暗黑机甲腿部 M3"

[DarkMec_Torso_N1 X2BodyPartTemplate]
DisplayName="暗黑机甲躯干 N1"

[DarkMec_Arms_N1 X2BodyPartTemplate]
DisplayName="暗黑机甲手臂 N1"

[DarkMec_Legs_N1 X2BodyPartTemplate]
DisplayName="暗黑机甲腿部 N1"

[DarkMec_Torso_N2 X2BodyPartTemplate]
DisplayName="暗黑机甲躯干 N2"

[DarkMec_Arms_N2 X2BodyPartTemplate]
DisplayName="暗黑机甲手臂 N2"

[DarkMec_Legs_N2 X2BodyPartTemplate]
DisplayName="暗黑机甲腿部 N2"

[DarkMec_Torso_N3 X2BodyPartTemplate]
DisplayName="暗黑机甲躯干 N3"

[DarkMec_Arms_N3 X2BodyPartTemplate]
DisplayName="暗黑机甲手臂 N3"

[DarkMec_Legs_N3 X2BodyPartTemplate]
DisplayName="暗黑机甲腿部 N3"
